Repository: bitcoin/bitcoin
Catalog: locale/*/LC_MESSAGES/bitcoin.po
Languages: pl

source: Unable to bind to port %d on this computer. Bitcoin is probably already running.
pl: Nie można powiązać z portem %d tego komputera. Prawdopodobnie program Bitcoin jest już uruchomiony.

source: Bitcoin version
pl: Wersja Bitcoin

source: Usage:
pl: Użycie:

source: Send command to -server or bitcoind
pl: Wyślij polecenie do -server lub bitcoind

source: List commands
pl: Wyświetl komendy

source: Get help for a command
pl: Wyświetl pomoc dla komendy

source: Options:
pl: Opcje:

source: Specify configuration file (default: bitcoin.conf)
pl: Określ plik konfiguracyjny (domyślnie: bitcoin.conf)

source: Specify pid file (default: bitcoind.pid)
pl: Wybierz plik pid (domyślnie: bitcoind.pid)

source: Generate coins
pl: Generuj monety

source: Don't generate coins
pl: Nie generuj monet

source: Start minimized
pl: Uruchom zminimalizowany

source: Specify data directory
pl: Wybierz katalog z danymi

source: Specify connection timeout (in milliseconds)
pl: Ustaw czas upływu połączenia (w milisekundach)

source: Connect through socks4 proxy
pl: Połącz przez socks4 proxy

source: Allow DNS lookups for addnode and connect
pl: Umożliwiaj wyszukiwanie DNS dla dodania węzła i połączenia

source: Add a node to connect to
pl: Dodaj węzeł do którego połączyć

source: Connect only to the specified node
pl: Łącz tylko z wybranym węzłem

source: Don't accept connections from outside
pl: Nie akceptuj połączeń z zewnątrz

source: Don't attempt to use UPnP to map the listening port
pl: Nie próbuj użyć UPnP dla mapowania portu nasłuchu

source: Attempt to use UPnP to map the listening port
pl: Próbuj użyć UPnP dla mapowania portu nasłuchu

source: Fee per KB to add to transactions you send
pl: Prowizja na KB dodawana do transakcji, które wysyłasz

source: Accept command line and JSON-RPC commands
pl: Akceptuj polecenia linii poleceń i JSON-RPC

source: Run in the background as a daemon and accept commands
pl: Uruchom w tle (daemon) i akceptuj komendy

source: Use the test network
pl: Użyj sieci testowej

source: Username for JSON-RPC connections
pl: Nazwa użytkownika dla połączeń JSON-RPC

source: Password for JSON-RPC connections
pl: Hasło dla połączeń JSON-RPC

source: Listen for JSON-RPC connections on <port> (default: 8332)
pl: Nasłuch dla połączeń JSON-RPC na porcie <port> (domyślnie: 8332)

source: Allow JSON-RPC connections from specified IP address
pl: Zezwól na połączenia JSON-RPC z adresu IP

source: Send commands to node running on <ip> (default: 127.0.0.1)
pl: Wysyłaj polecenia do węzła działającego na <ip> (domyślnie: 127.0.0.1)

source: Set key pool size to <n> (default: 100)
pl: Ustaw pulę kluczy na <n> (domyślnie: 100)

source: Rescan the block chain for missing wallet transactions
pl: Przeszukaj łańcuch bloków w poszukiwaniu zaginionych transakcji

source: SSL options: (see the Bitcoin Wiki for SSL setup instructions)
pl: Opcje SSL: (zobacz instrukcje na Bitcoin Wiki dla ustawień SSL)

source: Use OpenSSL (https) for JSON-RPC connections
pl: Użyj OpenSSL (https) dla połączeń JSON-RPC

source: Server certificate file (default: server.cert)
pl: Plik certyfikacji serwera (domyślnie: server.cert)

source: Server private key (default: server.pem)
pl: Klucz prywatny serwera (domyślnie: server.pem)

source: Acceptable ciphers (default: TLSv1+HIGH:!SSLv2:!aNULL:!eNULL:!AH:!3DES:@STRENGTH)
pl: Akceptowalne szyfry (domyślnie: TLSv1+HIGH:!SSLv2:!aNULL:!eNULL:!AH:!3DES:@STRENGTH)

source: This help message
pl: Ta wiadomość pomocy

source: Cannot obtain a lock on data directory %s. Bitcoin is probably already running.
pl: Nie można korzystać z katalogu %s z danymi. Bitcoin prawdopodobnie już jest uruchomiony.

source: Error loading addr.dat
pl: Błąd ładowania addr.dat

source: Error loading blkindex.dat
pl: Błąd ładowania blkindex.dat

source: Error loading wallet.dat: Wallet corrupted
pl: Błąd ładowania wallet.dat: Portfel uszkodzony

source: Error loading wallet.dat: Wallet requires newer version of Bitcoin
pl: Błąd ładowania wallet.dat: Portfel wymaga nowszej wersji Bitcoin

source: Error loading wallet.dat
pl: Błąd ładowania wallet.dat

source: Invalid -proxy address
pl: Niewłaściwy adres -proxy

source: Invalid amount for -paytxfee=<amount>
pl: Nieprawidłowa kwota w -paytxfee=<amount>

source: Warning: -paytxfee is set very high. This is the transaction fee you will pay if you send a transaction.
pl: Ostrzeżenie: ustawienie -paytxfee jest bardzo wysokie. To jest prowizja transakcji, którą zapłacisz jeżeli wyślesz transakcję.

source: To use the %s option
pl: Użycie opcji %s

source: Warning: %s, you must set rpcpassword=<password> in the configuration file: %s If the file does not exist, create it with owner-readable-only file permissions.
pl: Ostrzeżenie: %s, musisz ustawić rpcpassword=<password> w pliku konfiguracyjnym: %s Jeżeli plik nie istnieje, utwórz go z uprawnieniami tylko do odczytu dla właściciela.

source: You must set rpcpassword=<password> in the configuration file: %s If the file does not exist, create it with owner-readable-only file permissions.
pl: Musisz ustawić rpcpassword=<password> w pliku konfiguracyjnym: %s Jeżeli plik nie istnieje, utwórz go z uprawnieniami tylko do odczytu dla właściciela.

source: Warning: Please check that your computer's date and time are correct. If your clock is wrong Bitcoin will not work properly.
pl: Ostrzeżenie: Sprawdź czy ustawienia daty i czasu komputera są prawidłowe. Jeżeli zegar jest źle ustawiony, Bitcoin nie będzie poprawnie działał.

source: This transaction is over the size limit. You can still send it for a fee of %s, which goes to the nodes that process your transaction and helps to support the network. Do you want to pay the fee?
pl: Ta transakcja jest poza limitem wielkości. W dalszym ciągu możesz wysłać ją z prowizją %s, która dotrze do węzłów przetwarzających twoją transakcję i pomoże utrzymać sieć. Chcesz zapłacić prowizję?

source: Enter the current passphrase to the wallet.
pl: Wpisz obecne hasło do portfela.

source: Passphrase
pl: Hasło

source: Please supply the current wallet decryption passphrase.
pl: Proszę dostarczyć hasło do odszyfrowania portfela.

source: The passphrase entered for the wallet decryption was incorrect.
pl: Wpisane hasło do odszyfrowania portfela jest nieprawidłowe.

source: Date
pl: Data

source: Description
pl: Opis

source: Debit
pl: Obciążenie

source: Credit
pl: Suma

source: Open for %d blocks
pl: Otwórz na %d bloków

source: Open until %s
pl: Otwarte dopóki %s

source: %d/unconfirmed
pl: %d/niepotwierdzono

source: %d confirmations
pl: %d potwierdzeń

source: Generated
pl: Wygenerowano

source: Generated (%s matures in %d more blocks)
pl: Wygenerowano (%s dojrzałych w %d więcej bloków)

source: Generated - Warning: This block was not received by any other nodes and will probably not be accepted!
pl: Wygenerowano - Ostrzeżenie: Ten blok nie został otrzymany przez żaden inny węzeł i prawdopodobnie nie zostanie zaakceptowany!

source: Generated (not accepted)
pl: Wygenerowano (nie zaakceptowano)

source: From:
pl: Od:

source: Received with:
pl: Otrzymano z:

source: Payment to yourself
pl: Płatność dla siebie samego

source: To:
pl: Do:

source: Generating
pl: Generowanie

source: (not connected)
pl: (nie połączony)

source: %d connections %d blocks %d transactions
pl: %d połączeń %d bloków %d transakcji

source: Wallet already encrypted.
pl: Portfel już zaszyfrowany.

source: Enter the new passphrase to the wallet. Please use a passphrase of 10 or more random characters, or eight or more words.
pl: Wpisz nowe hasło dla portfela. Proszę użyć hasła składającego się z 10 lub więcej losowych znaków albo ośmiu lub więcej słów.

source: Error: The supplied passphrase was too short.
pl: Błąd: Dostarczone hasło jest za krótkie.

source: WARNING: If you encrypt your wallet and lose your passphrase, you will LOSE ALL OF YOUR BITCOINS! Are you sure you wish to encrypt your wallet?
pl: OSTRZEŻENIE: Jeżeli zaszyfrujesz swój portfel i zgubisz hasło, STRACISZ WSZYSTKIE SWOJE BITCOINY! Czy jesteś pewny, że chcesz zaszyfrować swój portfel?

source: Please re-enter your new wallet passphrase.
pl: Proszę powtórzyć nowe hasło do portfela.

source: Error: the supplied passphrases didn't match.
pl: Błąd: dostarczone hasła się nie zgadzają.

source: Wallet encryption failed.
pl: Szyfrowanie portfela nie powiodło się.

source: Wallet Encrypted. Remember that encrypting your wallet cannot fully protect your bitcoins from being stolen by malware infecting your computer.
pl: Portfel zaszyfrowany. Pamiętaj, że zaszyfrowanie portfela nie chroni w pełni twoich bitcoinów przed kradzieżą przeprowadzoną przez złośliwe oprogramowanie infekujące twój komputer.

source: Wallet is unencrypted, please encrypt it first.
pl: Portfel jest niezaszyfrowany, proszę najpierw zaszyfrować.

source: Enter the new passphrase for the wallet.
pl: Wprowadź nowe hasło dla portfela.

source: Re-enter the new passphrase for the wallet.
pl: Powtórnie wprowadź nowe hasło dla portfela.

source: Wallet Passphrase Changed.
pl: Hasło dla portfela zostało zmienione.

source: New Receiving Address
pl: Nowy Adres Odbiorczy

source: You should use a new address for each payment you receive. Label
pl: Powinieneś użyć nowego adresu dla każdej płatności, którą otrzymasz. Etykieta

source: , has not been successfully broadcast yet
pl: , nie został jeszcze prawidłowo rozgłoszony

source: , broadcast through %d node
pl: , rozgłasza przez %d węzeł

source: , broadcast through %d nodes
pl: , rozgłasza przez %d węzłów

source: <b>Date:</b>
pl: <b>Data:</b>

source: <b>Source:</b> Generated<br>
pl: <b>Źródło:</b> Wygenerowano<br>

source: <b>From:</b>
pl: <b>Od:</b>

source: unknown
pl: nieznany

source: <b>To:</b>
pl: <b>Do:</b>

source: (yours, label:
pl: (twoja, etykieta:

source: (yours)
pl: (twoja)

source: <b>Credit:</b>
pl: <b>Suma:</b>

source: (%s matures in %d more blocks)
pl: (%s dojrzałych w %d więcej bloków)

source: (not accepted)
pl: (nie zaakceptowano)

source: <b>Debit:</b>
pl: <b>Obciążenie:</b>

source: <b>Transaction fee:</b>
pl: <b>Prowizja transakcji:</b>

source: <b>Net amount:</b>
pl: <b>Kwota netto:</b>

source: Message:
pl: Wiadomość:

source: Comment:
pl: Komentarz:

source: Generated coins must wait 120 blocks before they can be spent. When you generated this block, it was broadcast to the network to be added to the block chain. If it fails to get into the chain, it will change to "not accepted" and not be spendable. This may occasionally happen if another node generates a block within a few seconds of yours.
pl: Wygenerowane monety muszą poczekać 120 bloków zanim mogą zostać wydane. Gdy wygenerowałeś ten blok, został rozgłoszony do sieci z przeznaczeniem do dodania do łańcucha bloków. Jeżeli nie uda się dodać bloku do łańcucha, zostanie oznaczony jako "nie zaakceptowany" i nie będzie mógł zostać wydany. Sporadycznie dzieje się tak jeżeli inny węzeł wygeneruje blok nie dalej niż kilka sekund od ciebie.

source: Cannot write autostart/bitcoin.desktop file
pl: Nie mogę zapisać pliku autostart/bitcoin.desktop

source: Main
pl: Główne

source: &Start Bitcoin on window system startup
pl: &Uruchom Bitcoin przy starcie systemu

source: &Minimize on close
pl: &Minimalizuj przy zamknięciu

source: version %s
pl: wersja %s

source: Error in amount
pl: Nieprawidłowa kwota

source: Send Coins
pl: Wyślij Monety

source: Amount exceeds your balance
pl: Kwota przekracza twój stan konta

source: Total exceeds your balance when the
pl: Przekroczenie twojego stanu konta gdy

source: transaction fee is included
pl: prowizja jest wliczona

source: Payment sent
pl: Wysłano płatność

source: Sending...
pl: Wysyłanie...

source: Invalid address
pl: Nieprawidłowy adres

source: Sending %s to %s
pl: Wysyłanie %s do %s

source: CANCELLED
pl: ANULOWANO

source: Cancelled
pl: Anulowano

source: Transfer cancelled
pl: Transfer anulowano

source: Error:
pl: Błąd:

source: Insufficient funds
pl: Niewystarczające fundusze

source: Connecting...
pl: Łączenie...

source: Unable to connect
pl: Nie można połączyć

source: Requesting public key...
pl: Żądanie klucza publicznego...

source: Received public key...
pl: Otrzymano klucz publiczny...

source: Recipient is not accepting transactions sent by IP address
pl: Adresat nie akceptuje transakcji wysyłanych przez adres IP

source: Transfer was not accepted
pl: Transfer nie został zaakceptowany

source: Invalid response received
pl: Otrzymano niepoprawną odpowiedź

source: Creating transaction...
pl: Tworzenie transakcji...

source: This transaction requires a transaction fee of at least %s because of its amount, complexity, or use of recently received funds
pl: Ta transakcja wymaga prowizji co najmniej %s z uwagi na kwotę, złożoność lub użycie niedawno otrzymanych funduszy

source: Transaction creation failed
pl: Błąd tworzenia transakcji

source: Transaction aborted
pl: Transakcję przerwano

source: Lost connection, transaction cancelled
pl: Utracono połączenie, transakcja anulowana

source: Sending payment...
pl: Wysyłanie płatności...

source: The transaction was rejected. This might happen if some of the coins in your wallet were already spent, such as if you used a copy of wallet.dat and coins were spent in the copy but not marked as spent here.
pl: Transakcja została odrzucona. Może się tak zdarzyć jeżeli część monet w twoim portfelu zostało wydanych, np. gdy użyto kopii pliku wallet.dat i monety zostały wydane w kopii, a tutaj nie zostały oznaczone jako wydane.

source: Waiting for confirmation...
pl: Oczekiwanie na potwierdzenie...

source: The payment was sent, but the recipient was unable to verify it. The transaction is recorded and will credit to the recipient, but the comment information will be blank.
pl: Płatność została wysłana, ale odbiorca nie mógł jej zweryfikować. Transakcja została zarejestrowana i zostanie przypisana do odbiorcy, ale informacja w komentarzu będzie pusta.

source: Payment was sent, but an invalid response was received
pl: Płatność została wysłana, ale otrzymano nieprawidłową odpowiedź

source: Payment completed
pl: Płatność zakończona

source: Name
pl: Nazwa

source: Address
pl: Adres

source: Label
pl: Etykieta

source: Bitcoin Address
pl: Adres Bitcoin

source: This is one of your own addresses for receiving payments and cannot be entered in the address book.
pl: To jest jeden z twoich adresów na otrzymywane płatności i nie może zostać wpisany do księgi adresowej.

source: Edit Address
pl: Edytuj Adres

source: Edit Address Label
pl: Edytuj Etykietę Adresu

source: Add Address
pl: Dodaj Adres

source: Bitcoin - Generating
pl: Bitcoin - Generowanie

source: Bitcoin - (not connected)
pl: Bitcoin - (nie połączony)

source: &Open Bitcoin
pl: &Otwórz Bitcoin

source: &Send Bitcoins
pl: &Wyślij Bitcoiny

source: O&ptions...
pl: O&pcje...

source: E&xit
pl: W&yjście

source: Program has crashed and will terminate.
pl: Program uległ awarii i zostanie przerwany.

source: Warning: Disk space is low
pl: Ostrzeżenie: Mało miejsca na dysku

source: &File
pl: &Plik

source: &Your Receiving Addresses...
pl: &Twój Adres Odbiorczy...

source: &Encrypt Wallet...
pl: &Zaszyfruj portfel...

source: &Change Wallet Encryption Passphrase...
pl: &Zmień hasło szyfrowania portfela...

source: &Options...
pl: &Opcje...

source: &Settings
pl: &Ustawienia

source: &About...
pl: &O programie...

source: &Help
pl: &Pomoc

source: Address Book
pl: Księga Adresowa

source: Your Bitcoin Address:
pl: Twój Adres Bitcoin:

source: &New...
pl: &Nowy...

source: &Copy to Clipboard
pl: &Kopiuj do schowka

source: Balance:
pl: Saldo:

source: All
pl: Wszystko

source: Sent
pl: Wysłano

source: Received
pl: Otrzymano

source: In Progress
pl: W Trakcie

source: All Transactions
pl: Wszystkie Transakcje

source: Sent/Received
pl: Wysłano/Otrzymano

source: Sent
pl: Wysłano

source: Received
pl: Otrzymano

source: &Start Bitcoin on system startup
pl: &Uruchom Bitcoin wraz ze startem systemu

source: &Minimize to the tray instead of the taskbar
pl: &Zminimalizuj do traya zamiast do paska zadań

source: Map port using &UPnP
pl: Mapuj port używając &UPnP

source: M&inimize to the tray on close
pl: Zm&inimalizuj do traya przy zamknięciu

source: &Connect through socks4 proxy:
pl: &Połącz przez socks4 proxy:

source: Optional transaction fee per KB that helps make sure your transactions are processed quickly. Most transactions are 1KB. Fee 0.01 recommended.
pl: Opcjonalna prowizja określona dla KB transakcji, która zapewni, że twoje transakcje będą szybko przetworzone. Większość transakcji to 1KB. Rekomendowana prowizja to 0.01.

source: Pay transaction fee:
pl: Płać prowizję transakcji:

source: Cancel
pl: Anuluj

source: &Apply
pl: &Zastosuj

source: version
pl: wersja

source: Copyright (c) 2009-2011 Bitcoin Developers This is experimental software. Distributed under the MIT/X11 software license, see the accompanying file license.txt or http://www.opensource.org/licenses/mit-license.php. This product includes software developed by the OpenSSL Project for use in the OpenSSL Toolkit (http://www.openssl.org/) and cryptographic software written by Eric Young (eay@cryptsoft.com) and UPnP software written by Thomas Bernard.
pl: Copyright (c) 2009-2011 Bitcoin Developers To oprogramowanie jest eksperymentalne. Dystrybuowane na licencji MIT/X11, zobacz towarzyszący plik license.txt lub http://www.opensource.org/licenses/mit-license.php. Ten produkt zawiera oprogramowanie rozwijane przez OpenSSL Project w OpenSSL Toolkit (http://www.openssl.org/) i oprogramowanie kryptograficzne napisane przez Erica Younga (eay@cryptsoft.com) oraz oprogramowanie UPnP napisane przez Thomasa Bernarda.

source: Enter a Bitcoin address (e.g. 1NS17iag9jJgTHD1VXjvLCEnZuQ3rJDE9L)
pl: Wprowadź adres Bitcoin (np. 1NS17iag9jJgTHD1VXjvLCEnZuQ3rJDE9L)

source: Pay &To:
pl: Wpłać &Dla:

source: &Paste
pl: &Wklej

source: Address &Book...
pl: Księga &Adresowa...

source: &Amount:
pl: &Kwota:

source: &Send
pl: &Wyślij

source: Connecting...
pl: Łączenie...

source: These are your Bitcoin addresses for receiving payments. You may want to give a different one to each sender so you can keep track of who is paying you. The highlighted address is displayed in the main window.
pl: To są twoje adresy Bitcoin dla otrzymywania płatności. Możesz chcieć podać różne dla każdego płacącego aby kontrolować kto ci płaci. Wyróżniony adres będzie wyświetlany w oknie głównym.

source: &Edit...
pl: &Edytuj...

source: &New Address...
pl: &Nowy Adres...

source: Sending
pl: Wysyłanie

source: These are your Bitcoin addresses for receiving payments. You can give a different one to each sender to keep track of who is paying you. The highlighted address will be displayed in the main window.
pl: To są twoje adresy Bitcoin dla otrzymywania płatności. Możesz podać różne dla każdego płacącego aby kontrolować kto ci płaci. Wyróżniony adres będzie wyświetlany w oknie głównym.

source: Receiving
pl: Otrzymywanie

source: &Delete
pl: &Usuń

source: Error: Wallet locked, unable to create transaction
pl: Błąd: Portfel zablokowany, nie można utworzyć transakcji

source: Error: This transaction requires a transaction fee of at least %s because of its amount, complexity, or use of recently received funds
pl: Błąd: Ta transakcja wymaga prowizji co najmniej %s z uwagi na kwotę, złożoność lub użycie niedawno otrzymanych funduszy

source: Error: Transaction creation failed
pl: Błąd: Nie udało się utworzyć transakcji

source: Error: The transaction was rejected. This might happen if some of the coins in your wallet were already spent, such as if you used a copy of wallet.dat and coins were spent in the copy but not marked as spent here.
pl: Błąd: Transakcja została odrzucona. Może się tak zdarzyć jeżeli część monet w twoim portfelu zostało wydanych, np. gdy użyto kopii pliku wallet.dat i monety zostały wydane w kopii, a tutaj nie zostały oznaczone jako wydane.

source: Invalid amount
pl: Niewłaściwa kwota

source: Invalid bitcoin address
pl: Niewłaściwy adres bitcoin

source: Transaction Details
pl: Szczegóły Transakcji

source: Options
pl: Opcje

source: About Bitcoin
pl: O Bitcoin

source: Your Bitcoin Addresses
pl: Twoje Adresy Bitcoin
